of_cases/damBreak/0.orig/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2268
(
0.00299993
0.00299994
0.00299993
0.00299994
0.00299994
0.00299993
0.00299994
0.00299993
...
)
;

boundaryField
{
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.00299993
0.0089998
0.0149997
0.0209995
0.0269994
0.0329993
0.0389992
0.044999
...
)
;
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.00299993
0.0089998
0.0149997
0.0209995
0.0269994
0.0329993
0.0389992
0.044999
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
62
(
0
0
0
0
0
0
0
0
...
)
;
    }
    atmosphere
    {
        type            calculated;
        value           nonuniform List<scalar> 
46
(
0.584
0.584
0.584
0.584
0.584
0.584
0.584
0.584
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
